app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "BadBoy"]]
---
  def profile
    #grab username from URL as ID
    if (User.find_by_username params[:id])